In [4]:
import pandas as pd
import numpy as np

# 创建数据框
df1 = pd.DataFrame({"a": [53, 232, 85, 464, 12],
                    "b": [1.94, 23.8, -8.3, 9.1, 1.1],
                    "c": [2, 4, 8, 10, 6]},
                   index=[101, 101, 102, 103, 103])
print(df1)

       a      b   c
101   53   1.94   2
101  232  23.80   4
102   85  -8.30   8
103  464   9.10  10
103   12   1.10   6

In [35]:
# 分组统计
gr_res = df1.groupby(by=df1.index, axis=0)
df3 = gr_res.agg({"a": sum, "b": np.mean, "c": np.std})
# gr_res.apply(sum)

In [18]:
df2 = pd.DataFrame({"a": ["abc", "ade", "awer"],
                    "b": [1, 4, 43]})
df2

      a   b
0   abc   1
1   ade   4
2  awer  43

In [22]:
df2["a"] = df2["a"].apply(lambda x: x.replace("e", "E"))
df2

      a   b
0   abc   1
1   adE   4
2  awEr  43

In [25]:
df1 ** 2 -100

          a         b   c
101    2709  -96.2364 -96
101   53724  466.4400 -84
102    7125  -31.1100 -36
103  215196  -17.1900   0
103      44  -98.7900 -64

a    101     53.0\n101    232.0\n102     85.0\n103 ...
b    101     1.94\n101    23.80\n102    -8.30\n103 ...
c    101     2.0\n101     4.0\n102     8.0\n103    ...
dtype: object

In [36]:
df3

       a      b         c
101  285  12.87  1.414214
102   85  -8.30       NaN
103  476   5.10  2.828427

In [37]:
df3.loc[102, "c"]

nan

In [38]:
type(df3.loc[102, "c"])

numpy.float64

In [39]:
np.nan

nan

In [40]:
type(np.nan)

float

In [41]:
df3.loc[102, "b"] = np.nan
df3

       a      b         c
101  285  12.87  1.414214
102   85    NaN       NaN
103  476   5.10  2.828427

In [52]:
df4 = pd.DataFrame({"a": [1, 2, 3],
                    "b": [4, 5, 6]},
                    index=[101, 102, 103])
df4

     a  b
101  1  4
102  2  5
103  3  6

In [54]:
df5 = pd.DataFrame({"b": [11, 12, 13],
                    "c": [14, 15, 16]},
                    index=[102, 104, 105])
df5

      b   c
102  11  14
104  12  15
105  13  16

In [60]:
df6 = pd.concat([df4, df5], axis=0,
                join="inner")
# df6.index = range(6)
df6

      b
101   4
102   5
103   6
102  11
104  12
105  13

In [59]:
df7 = pd.concat([df4, df5], axis=1,
                join="inner")
df7

     a  b   b   c
102  2  5  11  14

In [62]:
df7.columns = ["a", "b", "c", "d"]
df7

     a  b   c   d
102  2  5  11  14

In [65]:
df5

      b   c
102  11  14
104  12  15
105  13  16

In [71]:
# append方法添加行
sr2 = pd.Series([21, 22])
sr2.index = ["b", "c"]
sr2.name = 106
# df5.append(sr2)
df5.append(sr2)

      b   c
102  11  14
104  12  15
105  13  16
106  21  22

In [79]:
# append方法添加多行
df8 = pd.DataFrame({"b": [21],
                    "c": [32]},
                    index=[106])
df8
df5.append(df8)

      b   c
102  11  14
104  12  15
105  13  16
106  21  32

In [81]:
df4

     a  b
101  1  4
102  2  5
103  3  6

In [84]:
df5.loc[102, "b"] = 5
df5

      b   c
102   5  14
104  12  15
105  13  16

In [89]:
pd.merge(df4, df5, how="right", on="b")

     a   b   c
0  2.0   5  14
1  NaN  12  15
2  NaN  13  16